In [1]:
import pandas as pd
from typing import List

# Write a solution to find the nth highest salary from the Employee table. If there is no nth highest salary, return null.

In [2]:
data = {
    'id': [1, 2, 3],
    'salary': [100, 200, 300]
}

df = pd.DataFrame(data)
df

   id  salary
0   1     100
1   2     200
2   3     300

In [3]:
def nth_highest_salary(employee: pd.DataFrame, N: int) -> pd.DataFrame:
    if N>0:
            employee.drop_duplicates(subset='salary',inplace=True)
            employee.sort_values('salary',ascending=False,inplace=True)
            employee[f'getNthHighestSalary({N})']=employee.iloc[N-1:N,:]['salary']
            employee.dropna(inplace=True)
            if employee.shape[0]==0:
                return(pd.DataFrame({f'getNthHighestSalary({N})':[None]}))
                
            else:
                return(employee[[f'getNthHighestSalary({N})']])
    else:
        return(pd.DataFrame({f'getNthHighestSalary({N})':[None]}))

In [4]:
nth_highest_salary(df,2)

   getNthHighestSalary(2)
1                   200.0

# Write a solution to find the second highest salary from the Employee table. If there is no second highest salary, return null (return None in Pandas)

In [5]:
data = {
    'id': [1, 2, 3],
    'salary': [100, 200, 300]
}

df = pd.DataFrame(data)
df

   id  salary
0   1     100
1   2     200
2   3     300

In [6]:
def second_highest_salary(employee: pd.DataFrame) -> pd.DataFrame:
    employee.drop_duplicates(subset='salary',inplace=True)
    employee.sort_values('salary',ascending=False,inplace=True)
    employee['SecondHighestSalary']=employee[1:2]['salary']
    new_df=pd.DataFrame(employee['SecondHighestSalary'][1:2])
    if new_df.shape[0]!=1:
        return(pd.DataFrame({'SecondHighestSalary':[None]}))
    else:
        return(new_df)

In [7]:
second_highest_salary(df)

   SecondHighestSalary
1                200.0

# Write a solution to find employees who have the highest salary in each of the departments.

Return the result table in any order.

The result format is in the following example.

In [8]:
data = {
    "id": [1, 2, 3, 4, 5],
    "name": ["Joe", "Jim", "Henry", "Sam", "Max"],
    "salary": [70000, 90000, 80000, 60000, 90000],
    "departmentId": [1, 1, 2, 2, 1]
}

df = pd.DataFrame(data)
df2=pd.DataFrame({'id':[1,2],'name':['IT',"SALES"]})

In [9]:
def department_highest_salary(employee: pd.DataFrame, department: pd.DataFrame) -> pd.DataFrame:
    sal=[]
    for i in employee['departmentId'].unique():
        sal.append((i,employee[employee['departmentId']==i]['salary'].max()))
    dfs = []
    for x,j in sal:
        max_salary=employee[(employee['salary']==j) & (employee['departmentId']==x)]
        if not max_salary.empty:
            dfs.append(max_salary) 
    if not dfs:
        return pd.DataFrame(columns=['Department', 'Employee', 'Salary'])
    
    df3 = pd.concat(dfs, ignore_index=True)
    df3=pd.merge(department,df3,left_on='id',right_on='departmentId')
    df3.rename(columns={'name_x':'Department','name_y':'Employee','salary':'Salary'},inplace=True)
    return(df3[['Department','Employee','Salary']].drop_duplicates())

In [10]:
department_highest_salary(df,df2)

  Department Employee  Salary
0         IT      Jim   90000
1         IT      Max   90000
2      SALES    Henry   80000

# Write a solution to find the rank of the scores. The ranking should be calculated according to the following rules:

The scores should be ranked from the highest to the lowest.
If there is a tie between two scores, both should have the same ranking.
After a tie, the next ranking number should be the next consecutive integer value. In other words, there should be no holes between ranks.
Return the result table ordered by score in descending order.

In [11]:
data = {'id': [1, 2, 3, 4, 5, 6], 'score': [3.50, 3.65, 4.00, 3.85, 4.00, 3.65]}

df = pd.DataFrame(data)

In [12]:
def order_scores(scores: pd.DataFrame) -> pd.DataFrame:
    scores.sort_values('score',ascending=False,inplace=True)
    scores['rank']=scores['score'].rank(method='dense'
,ascending=False)
    return(scores[['score','rank']])

In [13]:
order_scores(df)

   score  rank
2   4.00   1.0
4   4.00   1.0
3   3.85   2.0
1   3.65   3.0
5   3.65   3.0
0   3.50   4.0

# Write a solution to delete all duplicate emails, keeping only one unique email with the smallest id.

For SQL users, please note that you are supposed to write a DELETE statement and not a SELECT one.

For Pandas users, please note that you are supposed to modify Person in place.

After running your script, the answer shown is the Person table. The driver will first compile and run your piece of code and then show the Person table. The final order of the Person table does not matter.

In [14]:
data = [
    {'id': 1, 'email': 'john@example.com'},
    {'id': 2, 'email': 'bob@example.com'},
    {'id': 3, 'email': 'john@example.com'},
]
df = pd.DataFrame(data)

In [15]:
df

   id             email
0   1  john@example.com
1   2   bob@example.com
2   3  john@example.com

In [16]:
def delete_duplicate_emails(person: pd.DataFrame) -> None:
    person.sort_values(by='id',inplace=True)
    person.drop_duplicates(subset='email',inplace=True)

# Write a solution to rearrange the Products table so that each row has (product_id, store, price). If a product is not available in a store, do not include a row with that product_id and store combination in the result table.

Return the result table in any order.

In [17]:

data = [
    {'product_id': 0, 'store1': 95, 'store2': 100, 'store3': 105},
    {'product_id': 1, 'store1': 70, 'store2': None, 'store3': 80}, 
]

df = pd.DataFrame(data)

In [18]:
def rearrange_products_table(products: pd.DataFrame) -> pd.DataFrame:
    products=products.melt(id_vars='product_id',value_vars=['store1','store2','store3'],var_name='store',value_name='price')
    products.sort_values(by='product_id',inplace=True)
    return(products.dropna())

In [19]:
rearrange_products_table(df)

   product_id   store  price
0           0  store1   95.0
2           0  store2  100.0
4           0  store3  105.0
1           1  store1   70.0
5           1  store3   80.0